{
  "footer": {
    "sig": "©Theo Gjini 2020",
    "github": "https://github.com/theogjini/",
    "thisRepo": "https://github.com/theogjini/folio",
    "linkedin": "https://linkedin.com/in/theo-gjini",
    "gitlab": "https://gitlab.com/theogjini",
    "mail": "mailto: theogjini@gmail.com"
  },
  "fr": {
    "general": {
      "menu": ["Projets", "Moi"]
    },
    "home": {
      "title": "Bienvenue! Je suis Théo,",
      "presentation": "Développeur Web junior basé à Montréal. Fraîchement diplômé du Bootcamp de l'Université Concordia en développement web FullStack. Freelance depuis mon diplôme (Caligram,  Moulin du Cénaret), je cherche aujourd'hui à partager ma passion dans une équipe!"
    },
    "about": {
      "work": "Actuellement employé chez D-BOX Technologies depuis 4 ans. Pour faire simple: je fais vibrer les chaises des spectateurs dans les cinémas. Exprimer sa créativité mène toujours quelque part!",
      "calig": "Caligram m'a offert mes premières missions Front-End, merci à eux de me transmettre un précieux savoir!",
      "freetimeTitle": "Ce que je fais de mes temps libres",
      "subtitle": "Travailler c'est bien tant qu'on ne fait pas que ça :)",
      "music": "Membre du groupe ''La verdine'' je suis guitariste depuis plus de 15 ans. On se voit à l'Escalier, au Dièse-Onze, ou au parc Laurier pour un jam!",
      "fish": "Amoureux de nature. Quand je ne suis pas en rando dans les Adirondacks, je parcours les rivières du québec ma canne à moucher à la main... "
    },
    "projects": [
      {
        "title": "Liane",
        "date": 2020,
        "specs": "MongoDB Microservices APIrest NodeJS ReactJS Redux GoogleAPI WebSocket Styled-Components",
        "usecase": "Vous êtes un singe et vous cherchez à partager vos trajets quotidiens. Sur... des lianes!!! Trouvez, communiquer et naviguez avec eux dans une seule app!",
        "description": "Autant dire que je me suis éclaté à créer cette maquette avec ces petits singes malicieux et animés. Cette application est le prototype d'un projet de plateforme de covoiturage en milieu rural, oui oui très serieux! D'ailleurs elle sera implémentée en France pour commencer avec vraisemblablement un Serveur en C# .Net et Front-End en react Native. Affaire à suivre!!",
        "link": "https://youtu.be/HUfHxE6-6Vo",
        "illus": "Liane",
        "repo": "https://github.com/theogjini/liane-proto",
        "responsive": true
      },
      {
        "title": "Calendrier Entrepreunariat Laval",
        "date": 2020,
        "specs": "Laravel ReactJS Redux",
        "usecase": "Intégration de la maquette UI, développement de toutes les pages, création d'un répertoire intéractif de recherche d'informations spécialisées. Intégration des vidéos.",
        "description": "Mon premier contrat avec Caligram! Explorer le code de caligram-react était difficile, recopier à la lettre toutes les subtilités de la maquette avec Css et Sass était érintant. Répondre aux demandes clients de dernière minute était instructif! Mais quel plaisir au travers de tout ça! D'autres à venir en 2020!",
        "link": "http://entrepreneuriatlaval.caligram.com/",
        "illus": "Entrepreunariat",
        "responsive": true
      },
      {
        "title": "Le moulin de Cénaret",
        "date": 2020,
        "specs": "TypeScript Docker MongoDB APIrest Microservices NodeJS Express NextJS ReactJS Redux Stripe Supertest Jest",
        "usecase": "Une e-boutique pour cet exceptionnel lieu qu'est le Moulin de Cénaret en Lozère. À paraître très bientôt.",
        "description": "Qu'est-ce qu'un bon framework JS? React. Qu'est-ce qu'un bon framework React? Next! SEO proof! CI proof avec Docker. Au fait, Typescript c'est top, je vous l'avais dit?",
        "link": "https://www.lemoulindecenaret.com/",
        "illus": "Moulin",
        "responsive": true
      },
      {
        "title": "Guithub",
        "date": 2020,
        "specs": "MongoDB APIrest NodeJS ReactJS Redux",
        "usecase": "Vous adorez les belles guitares? Les guitares chères? Achetez et vendez-en à travers ce e-commerce spécialisé!",
        "description": "Créer un compte, vendez et acheter des items, modifez-les à tout moment à travers votre profil! Comment ça j'ai fait ce site spécialement pour moi... Non mais... Bien trop cher pour moi! En passant, j'ai composé et interprété la musique de la vidéo!",
        "link": "https://www.youtube.com/watch?v=pbFqqD095EE",
        "illus": "Guithub",
        "repo": "https://github.com/theogjini/marketplace",
        "responsive": true
      },
      {
        "title": "Dave's Outrun",
        "date": 2019,
        "specs": "OOP NodeJS Javascript ES6",
        "usecase": "Vous tentez d'échapper aux assaults du puissant Goliath à bord de k2000! Récoltez tous les plus beaux souvenirs du Héros Michael Knight.",
        "description": "Collectez les vignettes, protégez vous, déplacez vous dans cette course infernale pour obtenir un prix exceptionnel. Programmation orientée objet. Quand un apprenti programmeur fan de Night Rider (bon quand j'étais petit hein... plus maintenant) rencontre les classes JS. J'ai même monté tous les sons originaux dedans!",
        "link": "https://www.youtube.com/watch?v=bqAGnD97irU",
        "illus": "Dave"
      }
    ]
  },
  "en": {
    "general": {
      "menu": ["Projects", "Me"]
    },
    "home": {
      "title": "Hi! I am Theo,",
      "presentation": "I am a Montreal based junior Web Developer. I just finished Full-Stack Concordia Bootcamp. Freelancer since I graduated (Caligram,  Moulin du Cénaret), I am looking for a dev team to share my passion!"
    },
    "about": {
      "work": "Work at D-Box technologies for 4 years now. To make it easy: I mak chair vibrate and moving for movies audience. Yeah, express creativity always leads you somewhere!",
      "calig": "Caligram is offering me my first Front-End missions,I thank them so much to teach me so intersting knowledge !",
      "freetimeTitle": "What do I do on my spare time?",
      "subtitle": "Working is good as long as we do something else also :)",
      "music": "Member af La Verdine band, I play guitar for more than 15 years now. Let's jam at l'Escalier, Dièse-Onze, or in Laurier park!",
      "fish": "Nature lover. When I am not hiking the Adirondacks mountains, I follow rivers with my fly fishing rod..."
    },
    "projects": [
      {
        "title": "Liane",
        "date": 2020,
        "specs": "MongoDB Microservices APIrest NodeJS ReactJS Redux GoogleAPI WebSocket Styled-Components",
        "usecase": "You are a poor little monkey travelling alone in the jungle every single day... Find mates, chat with them and navigate through this unique carpool app!",
        "description": "I have to say that making this was hilarious. I had so much pleasure animating and make a special place to those little scalawag monkeys. This app is the prototype of a real carpooling platform that is destinate to rural environment (yes, it's true!). By the way it will be implemented in France, with a nasty C# backend, and a pawerful React-Native Front-End... Stay tuned!!",
        "link": "https://youtu.be/HUfHxE6-6Vo",
        "repo": "https://github.com/theogjini/liane-proto",
        "illus": "Liane",
        "responsive": true
      },
      {
        "title": "Calendrier Entrepreunariat Laval",
        "date": 2020,
        "specs": "Laravel ReactJS Redux Sass",
        "usecase": "Integration of the UI mockup. Development of all the different pages.",
        "description": "My first gig with Caligram! Exploring caligram-react code was hard, digging CSS and Sass to match designer's treats was sweating, answering last minute client's request challenging. But, honestly... What a fun!! A lot more coming in 2020!",
        "link": "http://entrepreneuriatlaval.caligram.com/",
        "illus": "Entrepreunariat",
        "responsive": true
      },
      {
        "title": "Le moulin de Cénaret",
        "date": 2020,
        "specs": "TypeScript Docker MongoDB APIrest Microservices NodeJS Express NextJS ReactJS Redux Stripe Supertest Jest",
        "usecase": "A marketplace for this unique boutique in Lozère (France). Work in progress.",
        "description": "Do you know what a good JS framework is? React! Do you know what a good React framework is? Next! SEO proof. CI proof with Docker! And TypeScript is just awesome, did I mentionned this?",
        "link": "https://www.lemoulindecenaret.com/",
        "illus": "Moulin",
        "responsive": true
      },
      {
        "title": "Guithub",
        "date": 2020,
        "specs": "MongoDB APIrest NodeJS ReactJS Redux",
        "usecase": "Do you like guitars? Expensive ones? This is a nice place for this wierd addiction!",
        "description": "Create an account, buy and sell items. You can modify your ad at any time! No... I didn'd make this website specially for me... Come on, this is way too expensive! By the way, the music in the video is made (and played) by me!",
        "link": "https://www.youtube.com/watch?v=pbFqqD095EE",
        "illus": "Guithub",
        "repo": "https://github.com/theogjini/marketplace",
        "responsive": true
      },
      {
        "title": "Dave's Outrun",
        "date": 2019,
        "specs": "OOP NodeJS Javascript ES6",
        "usecase": "You are trying to escape the terrible Goliath, riding K200. Catch all the best memories of the simply named hero Michael Knight!",
        "description": "Collect all the vignettes, protect yourself, and try to win the incredible prize trying to finish this hellish run... Object Oriented Programming. When an apprentice developer Night Rider's fan (when I a was a kid ok?... Not anymore!) discover JavaScript classes. I even edited all the sounds effects and musics in it!",
        "link": "https://www.youtube.com/watch?v=bqAGnD97irU",
        "illus": "Dave"
      }
    ]
  }
}
